app/controllers/materials_controller.rb

SELECT "materials".* FROM "materials" WHERE "materials"."user_id" IS NULL ORDER BY created_at DESC
---
  def index
    @materials = Material.where(user_id: current_user).order("created_at DESC")

SELECT "reviews".* FROM "reviews" WHERE "reviews"."material_id" = ? ORDER BY created_at DESC  [["material_id", 4]]
---
  def show
    @reviews = Review.where(material_id: @material.id).order("created_at DESC")

INSERT INTO "materials" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Nucleya(U)"], ["content", "Behka"], ["created_at", "2018-07-09 00:53:08.027978"], ["updated_at", "2018-07-09 00:53:08.027978"], ["user_id", 1]]
---
  def create
    @material = current_user.materials.build(material_params)

    respond_to do |format|
      if @material.save

SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_material
      @material = Material.find(params[:id])