app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.material_id = @material.id
    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "updated_at", "user_id", "material_id") VALUES (?, ?, ?, ?, ?)  [["comment", "Great song!!"], ["created_at", "2018-07-10 22:20:54.485217"], ["updated_at", "2018-07-10 22:20:54.485217"], ["user_id", 1], ["material_id", 4]]

    def set_material
        @material = Material.find(params[:material_id])
---
SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]